; domain
(define (domain roverprob4213-domain)
 (:requirements :strips :typing :numeric-fluents)
 (:types rover waypoint store camera mode lander objective)
 (:predicates (in ?x - rover ?y - waypoint) (at_lander ?x_0 - lander ?y - waypoint) (can_traverse ?r - rover ?x_1 - waypoint ?y - waypoint) (equipped_for_soil_analysis ?r - rover) (equipped_for_rock_analysis ?r - rover) (equipped_for_imaging ?r - rover) (empty ?s - store) (have_rock_analysis ?r - rover ?w - waypoint) (have_soil_analysis ?r - rover ?w - waypoint) (full ?s - store) (calibrated ?c - camera ?r - rover) (supports ?c - camera ?m - mode) (available ?r - rover) (visible ?w - waypoint ?p - waypoint) (have_image ?r - rover ?o - objective ?m - mode) (communicated_soil_data ?w - waypoint) (communicated_rock_data ?w - waypoint) (communicated_image_data ?o - objective ?m - mode) (at_soil_sample ?w - waypoint) (at_rock_sample ?w - waypoint) (visible_from ?o - objective ?w - waypoint) (store_of ?s - store ?r - rover) (calibration_target ?i - camera ?o - objective) (on_board ?i - camera ?r - rover) (channel_free ?l - lander) (in_sun ?w - waypoint))
 (:functions (energy ?r - rover) (recharges))
 (:action navigate
  :parameters ( ?x - rover ?y - waypoint ?z - waypoint)
  :precondition (and (can_traverse ?x ?y ?z) (available ?x) (in ?x ?y) (visible ?y ?z) (<= 8 (energy ?x)))
  :effect (and (decrease (energy ?x) 8) (not (in ?x ?y)) (in ?x ?z)))
 (:action recharge
  :parameters ( ?x - rover ?w - waypoint)
  :precondition (and (in ?x ?w) (in_sun ?w) (<= (energy ?x) 80))
  :effect (and (increase (energy ?x) 20) (increase (recharges) 1)))
 (:action sample_soil
  :parameters ( ?x - rover ?s - store ?p - waypoint)
  :precondition (and (in ?x ?p) (<= 3 (energy ?x)) (at_soil_sample ?p) (equipped_for_soil_analysis ?x) (store_of ?s ?x) (empty ?s))
  :effect (and (not (empty ?s)) (full ?s) (decrease (energy ?x) 3) (have_soil_analysis ?x ?p) (not (at_soil_sample ?p))))
 (:action sample_rock
  :parameters ( ?x - rover ?s - store ?p - waypoint)
  :precondition (and (in ?x ?p) (<= 5 (energy ?x)) (at_rock_sample ?p) (equipped_for_rock_analysis ?x) (store_of ?s ?x) (empty ?s))
  :effect (and (not (empty ?s)) (full ?s) (decrease (energy ?x) 5) (have_rock_analysis ?x ?p) (not (at_rock_sample ?p))))
 (:action drop
  :parameters ( ?x - rover ?y_0 - store)
  :precondition (and (store_of ?y_0 ?x) (full ?y_0))
  :effect (and (not (full ?y_0)) (empty ?y_0)))
 (:action calibrate
  :parameters ( ?r - rover ?i - camera ?t - objective ?w - waypoint)
  :precondition (and (equipped_for_imaging ?r) (<= 2 (energy ?r)) (calibration_target ?i ?t) (in ?r ?w) (visible_from ?t ?w) (on_board ?i ?r))
  :effect (and (decrease (energy ?r) 2) (calibrated ?i ?r)))
 (:action take_image
  :parameters ( ?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
  :precondition (and (calibrated ?i ?r) (on_board ?i ?r) (equipped_for_imaging ?r) (supports ?i ?m) (visible_from ?o ?p) (in ?r ?p) (<= 1 (energy ?r)))
  :effect (and (have_image ?r ?o ?m) (not (calibrated ?i ?r)) (decrease (energy ?r) 1)))
 (:action communicate_soil_data
  :parameters ( ?r - rover ?l - lander ?p - waypoint ?x_1 - waypoint ?y - waypoint)
  :precondition (and (in ?r ?x_1) (at_lander ?l ?y) (have_soil_analysis ?r ?p) (visible ?x_1 ?y) (available ?r) (channel_free ?l) (<= 4 (energy ?r)))
  :effect (and (communicated_soil_data ?p) (available ?r) (decrease (energy ?r) 4)))
 (:action communicate_rock_data
  :parameters ( ?r - rover ?l - lander ?p - waypoint ?x_1 - waypoint ?y - waypoint)
  :precondition (and (in ?r ?x_1) (at_lander ?l ?y) (have_rock_analysis ?r ?p) (<= 4 (energy ?r)) (visible ?x_1 ?y) (available ?r) (channel_free ?l))
  :effect (and (communicated_rock_data ?p) (available ?r) (decrease (energy ?r) 4)))
 (:action communicate_image_data
  :parameters ( ?r - rover ?l - lander ?o - objective ?m - mode ?x_1 - waypoint ?y - waypoint)
  :precondition (and (in ?r ?x_1) (at_lander ?l ?y) (have_image ?r ?o ?m) (visible ?x_1 ?y) (available ?r) (channel_free ?l) (<= 6 (energy ?r)))
  :effect (and (communicated_image_data ?o ?m) (available ?r) (decrease (energy ?r) 6)))
)

; problem
(define (problem roverprob4213-problem)
 (:domain roverprob4213-domain)
 (:objects
   rover0 - rover
   waypoint0 waypoint1 waypoint2 waypoint3 - waypoint
   rover0store - store
   camera0 camera1 - camera
   colour high_res low_res - mode
   general - lander
   objective0 objective1 - objective
 )
 (:init (visible waypoint0 waypoint1) (visible waypoint1 waypoint0) (visible waypoint1 waypoint2) (visible waypoint2 waypoint1) (visible waypoint1 waypoint3) (visible waypoint3 waypoint1) (visible waypoint2 waypoint0) (visible waypoint0 waypoint2) (visible waypoint2 waypoint3) (visible waypoint3 waypoint2) (visible waypoint3 waypoint0) (visible waypoint0 waypoint3) (= (recharges) 0) (at_soil_sample waypoint0) (at_rock_sample waypoint0) (in_sun waypoint1) (in_sun waypoint3) (at_lander general waypoint1) (channel_free general) (= (energy rover0) 50) (in rover0 waypoint0) (available rover0) (store_of rover0store rover0) (empty rover0store) (equipped_for_soil_analysis rover0) (equipped_for_rock_analysis rover0) (equipped_for_imaging rover0) (can_traverse rover0 waypoint0 waypoint1) (can_traverse rover0 waypoint1 waypoint0) (can_traverse rover0 waypoint0 waypoint2) (can_traverse rover0 waypoint2 waypoint0) (can_traverse rover0 waypoint0 waypoint3) (can_traverse rover0 waypoint3 waypoint0) (on_board camera0 rover0) (calibration_target camera0 objective0) (supports camera0 colour) (supports camera0 high_res) (supports camera0 low_res) (on_board camera1 rover0) (calibration_target camera1 objective1) (supports camera1 high_res) (visible_from objective0 waypoint0) (visible_from objective1 waypoint0) (visible_from objective1 waypoint1) (visible_from objective1 waypoint2))
 (:goal (and (communicated_soil_data waypoint0) (communicated_rock_data waypoint0) (communicated_image_data objective1 low_res)))
 (:metric minimize (recharges))
)

; plan
1. (navigate rover0 waypoint0 waypoint2)
   deleted: (in rover0 waypoint0)
   added: (in rover0 waypoint2)
   changed: (energy rover0) from 50 to 42
   goals met: 0 of 3
2. (navigate rover0 waypoint2 waypoint0)
   deleted: (in rover0 waypoint2)
   added: (in rover0 waypoint0)
   changed: (energy rover0) from 42 to 34
   goals met: 0 of 3
3. (calibrate rover0 camera1 objective1 waypoint0)
   added: (calibrated camera1 rover0)
   changed: (energy rover0) from 34 to 32
   goals met: 0 of 3
4. (calibrate rover0 camera0 objective0 waypoint0)
   added: (calibrated camera0 rover0)
   changed: (energy rover0) from 32 to 30
   goals met: 0 of 3
5. (navigate rover0 waypoint0 waypoint3)
   deleted: (in rover0 waypoint0)
   added: (in rover0 waypoint3)
   changed: (energy rover0) from 30 to 22
   goals met: 0 of 3
6. (recharge rover0 waypoint3)
   changed: (energy rover0) from 22 to 42, (recharges) from 0 to 1
   goals met: 0 of 3
7. (recharge rover0 waypoint3)
   changed: (energy rover0) from 42 to 62, (recharges) from 1 to 2
   goals met: 0 of 3
8. (recharge rover0 waypoint3)
   changed: (energy rover0) from 62 to 82, (recharges) from 2 to 3
   goals met: 0 of 3
9. (navigate rover0 waypoint3 waypoint0)
   deleted: (in rover0 waypoint3)
   added: (in rover0 waypoint0)
   changed: (energy rover0) from 82 to 74
   goals met: 0 of 3
10. (navigate rover0 waypoint0 waypoint2)
   deleted: (in rover0 waypoint0)
   added: (in rover0 waypoint2)
   changed: (energy rover0) from 74 to 66
   goals met: 0 of 3
11. (take_image rover0 waypoint2 objective1 camera0 high_res)
   deleted: (calibrated camera0 rover0)
   added: (have_image rover0 objective1 high_res)
   changed: (energy rover0) from 66 to 65
   goals met: 0 of 3
12. (communicate_image_data rover0 general objective1 high_res waypoint2 waypoint1)
   added: (communicated_image_data objective1 high_res)
   changed: (energy rover0) from 65 to 59
   goals met: 0 of 3
13. (calibrate rover0 camera1 objective1 waypoint2)
   changed: (energy rover0) from 59 to 57
   goals met: 0 of 3
14. (take_image rover0 waypoint2 objective1 camera1 high_res)
   deleted: (calibrated camera1 rover0)
   changed: (energy rover0) from 57 to 56
   goals met: 0 of 3
15. (navigate rover0 waypoint2 waypoint0)
   deleted: (in rover0 waypoint2)
   added: (in rover0 waypoint0)
   changed: (energy rover0) from 56 to 48
   goals met: 0 of 3
16. (calibrate rover0 camera1 objective1 waypoint0)
   added: (calibrated camera1 rover0)
   changed: (energy rover0) from 48 to 46
   goals met: 0 of 3
17. (take_image rover0 waypoint0 objective1 camera1 high_res)
   deleted: (calibrated camera1 rover0)
   changed: (energy rover0) from 46 to 45
   goals met: 0 of 3
18. (calibrate rover0 camera0 objective0 waypoint0)
   added: (calibrated camera0 rover0)
   changed: (energy rover0) from 45 to 43
   goals met: 0 of 3
19. (take_image rover0 waypoint0 objective0 camera0 low_res)
   deleted: (calibrated camera0 rover0)
   added: (have_image rover0 objective0 low_res)
   changed: (energy rover0) from 43 to 42
   goals met: 0 of 3
20. (sample_rock rover0 rover0store waypoint0)
   deleted: (empty rover0store) (at_rock_sample waypoint0)
   added: (full rover0store) (have_rock_analysis rover0 waypoint0)
   changed: (energy rover0) from 42 to 37
   goals met: 0 of 3
21. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 0 of 3
22. (communicate_rock_data rover0 general waypoint0 waypoint0 waypoint1)
   added: (communicated_rock_data waypoint0)
   changed: (energy rover0) from 37 to 33
   goals met: 1 of 3
23. (navigate rover0 waypoint0 waypoint1)
   deleted: (in rover0 waypoint0)
   added: (in rover0 waypoint1)
   changed: (energy rover0) from 33 to 25
   goals met: 1 of 3
24. (recharge rover0 waypoint1)
   changed: (energy rover0) from 25 to 45, (recharges) from 3 to 4
   goals met: 1 of 3
25. (calibrate rover0 camera1 objective1 waypoint1)
   added: (calibrated camera1 rover0)
   changed: (energy rover0) from 45 to 43
   goals met: 1 of 3
26. (calibrate rover0 camera1 objective1 waypoint1)
   changed: (energy rover0) from 43 to 41
   goals met: 1 of 3
27. (take_image rover0 waypoint1 objective1 camera1 high_res)
   deleted: (calibrated camera1 rover0)
   changed: (energy rover0) from 41 to 40
   goals met: 1 of 3
28. (recharge rover0 waypoint1)
   changed: (energy rover0) from 40 to 60, (recharges) from 4 to 5
   goals met: 1 of 3
29. (navigate rover0 waypoint1 waypoint0)
   deleted: (in rover0 waypoint1)
   added: (in rover0 waypoint0)
   changed: (energy rover0) from 60 to 52
   goals met: 1 of 3
30. (communicate_image_data rover0 general objective0 low_res waypoint0 waypoint1)
   added: (communicated_image_data objective0 low_res)
   changed: (energy rover0) from 52 to 46
   goals met: 1 of 3
31. (communicate_rock_data rover0 general waypoint0 waypoint0 waypoint1)
   changed: (energy rover0) from 46 to 42
   goals met: 1 of 3
32. (communicate_rock_data rover0 general waypoint0 waypoint0 waypoint1)
   changed: (energy rover0) from 42 to 38
   goals met: 1 of 3
33. (communicate_rock_data rover0 general waypoint0 waypoint0 waypoint1)
   changed: (energy rover0) from 38 to 34
   goals met: 1 of 3
34. (navigate rover0 waypoint0 waypoint3)
   deleted: (in rover0 waypoint0)
   added: (in rover0 waypoint3)
   changed: (energy rover0) from 34 to 26
   goals met: 1 of 3
35. (communicate_image_data rover0 general objective0 low_res waypoint3 waypoint1)
   changed: (energy rover0) from 26 to 20
   goals met: 1 of 3
36. (communicate_image_data rover0 general objective0 low_res waypoint3 waypoint1)
   changed: (energy rover0) from 20 to 14
   goals met: 1 of 3
37. (communicate_image_data rover0 general objective0 low_res waypoint3 waypoint1)
   changed: (energy rover0) from 14 to 8
   goals met: 1 of 3
38. (recharge rover0 waypoint3)
   changed: (energy rover0) from 8 to 28, (recharges) from 5 to 6
   goals met: 1 of 3
39. (communicate_rock_data rover0 general waypoint0 waypoint3 waypoint1)
   changed: (energy rover0) from 28 to 24
   goals met: 1 of 3
40. (recharge rover0 waypoint3)
   changed: (energy rover0) from 24 to 44, (recharges) from 6 to 7
   goals met: 1 of 3
41. (recharge rover0 waypoint3)
   changed: (energy rover0) from 44 to 64, (recharges) from 7 to 8
   goals met: 1 of 3
42. (navigate rover0 waypoint3 waypoint0)
   deleted: (in rover0 waypoint3)
   added: (in rover0 waypoint0)
   changed: (energy rover0) from 64 to 56
   goals met: 1 of 3
43. (navigate rover0 waypoint0 waypoint2)
   deleted: (in rover0 waypoint0)
   added: (in rover0 waypoint2)
   changed: (energy rover0) from 56 to 48
   goals met: 1 of 3
44. (calibrate rover0 camera1 objective1 waypoint2)
   added: (calibrated camera1 rover0)
   changed: (energy rover0) from 48 to 46
   goals met: 1 of 3
45. (navigate rover0 waypoint2 waypoint0)
   deleted: (in rover0 waypoint2)
   added: (in rover0 waypoint0)
   changed: (energy rover0) from 46 to 38
   goals met: 1 of 3
46. (calibrate rover0 camera0 objective0 waypoint0)
   added: (calibrated camera0 rover0)
   changed: (energy rover0) from 38 to 36
   goals met: 1 of 3
47. (navigate rover0 waypoint0 waypoint2)
   deleted: (in rover0 waypoint0)
   added: (in rover0 waypoint2)
   changed: (energy rover0) from 36 to 28
   goals met: 1 of 3
48. (take_image rover0 waypoint2 objective1 camera0 low_res)
   deleted: (calibrated camera0 rover0)
   added: (have_image rover0 objective1 low_res)
   changed: (energy rover0) from 28 to 27
   goals met: 1 of 3
49. (communicate_image_data rover0 general objective1 low_res waypoint2 waypoint1)
   added: (communicated_image_data objective1 low_res)
   changed: (energy rover0) from 27 to 21
   goals met: 2 of 3
50. (communicate_image_data rover0 general objective1 high_res waypoint2 waypoint1)
   changed: (energy rover0) from 21 to 15
   goals met: 2 of 3
51. (navigate rover0 waypoint2 waypoint0)
   deleted: (in rover0 waypoint2)
   added: (in rover0 waypoint0)
   changed: (energy rover0) from 15 to 7
   goals met: 2 of 3
52. (sample_soil rover0 rover0store waypoint0)
   deleted: (empty rover0store) (at_soil_sample waypoint0)
   added: (full rover0store) (have_soil_analysis rover0 waypoint0)
   changed: (energy rover0) from 7 to 4
   goals met: 2 of 3
53. (communicate_soil_data rover0 general waypoint0 waypoint0 waypoint1)
   added: (communicated_soil_data waypoint0)
   changed: (energy rover0) from 4 to 0
   goals met: 3 of 3
